ИнКар.Маркетплейсы/src/Catalogs/МП_ЮлаРазмещенияОбъявлений/МП_ЮлаРазмещенияОбъявлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_ЮлаРазмещенияОбъявлений</name>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.МП_ЮлаКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.МП_ЮлаПодкатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДетали</name>
    <type>
      <types>CatalogRef.МП_ЮлаТипыДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДеталей</name>
    <type>
      <types>CatalogRef.МП_ЮлаГруппыДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеДетали</name>
    <type>
      <types>CatalogRef.МП_ЮлаНазванияДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодыРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/Catalogs/МП_ЮлаРазмещенияОбъявлений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПодкатегорияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТипДеталиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДеталейПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НазваниеДеталиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьНаименование()
	
	Перем ДляНаименования;
	
	ДляНаименования = Новый Массив();
	
	ДобавитьНеПустуюСтроку(Элементы.Категория.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.Подкатегория.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.ТипДетали.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.ГруппаДеталей.ТекстРедактирования, ДляНаименования);
	ДобавитьНеПустуюСтроку(Элементы.НазваниеДетали.ТекстРедактирования, ДляНаименования);
	
	Объект.Наименование = СтрСоединить(ДляНаименования, "/");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНеПустуюСтроку(Строка, Массив);

	Если Не ПустаяСтрока(Строка) Тогда
		Массив.Добавить(Строка);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
